<h1>Practical-6-Database-interfacing

<h5>Name : Tarpara Kaushal
<h5>Roll no : MA060

<h3>1. Create connection to the mysql on localhost.

In [2]:
import mysql.connector

con = mysql.connector.connect(host="localhost", user="root", password="")

print("Connection = ",con)

con.close()

Connection =  <mysql.connector.connection.MySQLConnection object at 0x00000187ED9B2560>

<h3>2. List all the databases available in your system.

In [3]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="")
cursor = conn.cursor()
cursor.execute("SHOW DATABASES")
for db in cursor.fetchall():
    print(db[0])
cursor.close()
conn.close()

db_springjpa
dbstudent
information_schema
mysql
performance_schema
sys

<h3>3. Create a database dbStudent. Connect to it.

In [7]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="")
cursor = conn.cursor()
cursor.execute("CREATE DATABASE IF NOT EXISTS dbStudent")
print("'dbStudent' database Created")
cursor.close()

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
print("Connected to 'dbStudent' database")

'dbStudent' database Created
Connected to 'dbStudent' database

<h3>4. Create a table tblStudent with columns of suitable type: rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks,totalmarks, percentage and grade.

In [1]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

create_table_query = """
    CREATE TABLE IF NOT EXISTS tblStudent (
        rollno INT PRIMARY KEY,
        name VARCHAR(255),
        birthdate DATE,
        gender ENUM('Male', 'Female', 'Other'),
        cmarks INT,
        cppmarks INT,
        pythonmarks INT,
        totalmarks INT,
        percentage DECIMAL(5, 2),
        grade CHAR(1)
    )
"""

cursor.execute(create_table_query)
conn.commit()
cursor.close()
conn.close()

print("Table 'tblStudent' created successfully.")

Table 'tblStudent' created successfully.

<h3>5. Insert at least 10 rows (only rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks) into tblStudent. Use different ways for the same (as shown in various examples shown above).

In [2]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

student_data = [
    (1, 'Amit Patel', '1997-06-15', 'Male', 82, 88, 76),
    (2, 'Priya Singh', '1998-03-28', 'Female', 78, 85, 92),
    (3, 'Rahul Sharma', '1997-09-10', 'Male', 90, 92, 88),
    (4, 'Deepika Reddy', '1996-04-25', 'Female', 88, 80, 78),
    (5, 'Rajesh Kumar', '1998-02-10', 'Male', 92, 89, 90),
    (6, 'Pooja Verma', '1997-07-18', 'Female', 84, 87, 85),
    (7, 'Sachin Gupta', '1996-11-20', 'Male', 85, 78, 88),
    (8, 'Neha Mishra', '1998-05-08', 'Female', 79, 86, 94),
    (9, 'Vikas Yadav', '1997-08-12', 'Male', 88, 91, 84),
    (10, 'Anita Choudhary', '1998-01-05', 'Female', 82, 83, 87)
]

insert_query = """
    INSERT INTO tblStudent (rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks)
    VALUES (%s, %s, %s, %s, %s, %s, %s)
"""

cursor.executemany(insert_query, student_data)
conn.commit()

cursor.close()
conn.close()

print("Inserted student data into 'tblStudent' successfully.")

Inserted student data into 'tblStudent' successfully.

<h3>6. Print all rows (only rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks) on screen (as shown in various examples shown above).

In [9]:
import mysql.connector
 
conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

cursor.execute("SELECT rollno, name, DATE_FORMAT(birthdate, '%Y-%m-%d'), gender, cmarks, cppmarks, pythonmarks FROM tblStudent")

student_records = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8} {:<7} {:<7} {:<7}".format("Roll No", "Name", "Birthdate", "Gender", "C Marks", "CPP Marks", "Python Marks"))
print("="*78)

for record in student_records:
    rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks = record
    print("{:<8} {:<15} {:<12} {:<8} {:<7} {:<9} {:<7}".format(rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks))

cursor.close()
conn.close()

Roll No  Name            Birthdate    Gender   C Marks CPP Marks Python Marks
==============================================================================
1        Amit Patel      1997-06-15   Male     82      88        76
2        Priya Singh     1998-03-28   Female   78      85        92
3        Rahul Sharma    1997-09-10   Male     90      92        88
4        Deepika Reddy   1996-04-25   Female   88      80        78
5        Rajesh Kumar    1998-02-10   Male     92      89        90
6        Pooja Verma     1997-07-18   Female   84      87        85
7        Sachin Gupta    1996-11-20   Male     85      78        88
8        Neha Mishra     1998-05-08   Female   79      86        94
9        Vikas Yadav     1997-08-12   Male     88      91        84
10       Anita Choudhary 1998-01-05   Female   82      83        87

<h3>7. Compute & update totalmarks for all rows in table.

In [10]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

compute_total_query = "UPDATE tblStudent SET totalmarks = cmarks + cppmarks + pythonmarks"
cursor.execute(compute_total_query)
conn.commit()

cursor.close()
conn.close()

print("Totalmarks computed and updated successfully for all rows.")

Totalmarks computed and updated successfully for all rows.

<h3>8. Compute & update percentage for all rows in table.

In [11]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

compute_percentage_query = "UPDATE tblStudent SET percentage = (cmarks + cppmarks + pythonmarks) / 3"
cursor.execute(compute_percentage_query)
conn.commit()

cursor.close()
conn.close()

print("Percentage computed and updated successfully for all rows.")

Percentage computed and updated successfully for all rows.

<h3>9. Compute & update grade for all rows in table.

In [1]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

compute_grade_query = """
    UPDATE tblStudent
    SET grade = CASE
        WHEN percentage >= 90 THEN 'A'
        WHEN percentage >= 80 THEN 'B'
        WHEN percentage >= 70 THEN 'C'
        WHEN percentage >= 60 THEN 'D'
        WHEN percentage >= 50 THEN 'E'
        ELSE 'F'
    END
"""

cursor.execute(compute_grade_query)
conn.commit()

cursor.close()
conn.close()

print("Grade computed and updated successfully for all rows.")

Grade computed and updated successfully for all rows.

<h3>10. Print all rows (all columns).

In [35]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

select_all_query = "SELECT rollno, name, DATE_FORMAT(birthdate, '%Y-%m-%d'), gender, cmarks, cppmarks, pythonmarks,totalmarks, percentage, grade FROM tblStudent"
cursor.execute(select_all_query)

student_records = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8} {:<7} {:<7} {:13}{:<7} {:<7} {:<7}".format("Roll No", "Name", "Birthdate", "Gender", "C", "CPP", "Python","Totalmarks", "Percentage", "Grade" ))
print("="*108)


    
for record in student_records:
    rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks, totalmarks, percentage, grade = record
    print("{:<8} {:<15} {:<12} {:<8} {:<7} {:<9} {:<12} {:<10} {:<10} {:<7}".format(rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks, totalmarks, percentage, grade))
 
cursor.close()
conn.close()

Roll No  Name            Birthdate    Gender   C       CPP     Python       Totalmarks Percentage Grade
============================================================================================================
1        Amit Patel      1997-06-15   Male     82      88        76           246        82.00      B
2        Priya Singh     1998-03-28   Female   78      85        92           255        85.00      B
3        Rahul Sharma    1997-09-10   Male     90      92        88           270        90.00      A
4        Deepika Reddy   1996-04-25   Female   88      80        78           246        82.00      B
5        Rajesh Kumar    1998-02-10   Male     92      89        90           271        90.33      A
6        Pooja Verma     1997-07-18   Female   84      87        85           256        85.33      B
7        Sachin Gupta    1996-11-20   Male     85      78        88           251        83.67      B
8        Neha Mishra     1998-05-08   Female   79      86        94           259        86.33      B
9        Vikas Yadav     1997-08-12   Male     88      91        84           263        87.67      B
10       Anita Choudhary 1998-01-05   Female   82      83        87           252        84.00      B

<h3>11. Print all rows with only columns: rollno, name, percentage and grade.

In [43]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

select_query = "SELECT rollno, name, percentage, grade FROM tblStudent"
cursor.execute(select_query)

student_records = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8} ".format("Roll No", "Name", "Percentage", "Grade" )) 
print("="*43)
for record in student_records:
    rollno, name, percentage, grade = record
    print("{:<8} {:<15} {:<12} {:<8} ".format(rollno, name, percentage, grade))
 

cursor.close()
conn.close()

Roll No  Name            Percentage   Grade
===========================================
1        Amit Patel      82.00        B
2        Priya Singh     85.00        B
3        Rahul Sharma    90.00        A
4        Deepika Reddy   82.00        B
5        Rajesh Kumar    90.33        A
6        Pooja Verma     85.33        B
7        Sachin Gupta    83.67        B
8        Neha Mishra     86.33        B
9        Vikas Yadav     87.67        B
10       Anita Choudhary 84.00        B

<h3>12. Print merit list.

In [44]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

select_query = "SELECT rollno, name, percentage, grade FROM tblStudent ORDER BY percentage DESC"
cursor.execute(select_query)

student_records = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8}".format("Roll No", "Name", "Percentage", "Grade"))
print("=" * 43)

for record in student_records:
    rollno, name, percentage, grade = record
    print("{:<8} {:<15} {:<12} {:<8}".format(rollno, name, percentage, grade))

cursor.close()
conn.close()

Roll No  Name            Percentage   Grade
===========================================
5        Rajesh Kumar    90.33        A
3        Rahul Sharma    90.00        A
9        Vikas Yadav     87.67        B
8        Neha Mishra     86.33        B
6        Pooja Verma     85.33        B
2        Priya Singh     85.00        B
10       Anita Choudhary 84.00        B
7        Sachin Gupta    83.67        B
1        Amit Patel      82.00        B
4        Deepika Reddy   82.00        B

<h3>13. Print first two toppers.

In [45]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

select_query = "SELECT rollno, name, percentage, grade FROM tblStudent ORDER BY percentage DESC LIMIT 2"
cursor.execute(select_query)

toppers = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8}".format("Roll No", "Name", "Percentage", "Grade"))
print("=" * 43)

for record in toppers:
    rollno, name, percentage, grade = record
    print("{:<8} {:<15} {:<12} {:<8}".format(rollno, name, percentage, grade))

cursor.close()
conn.close()

Roll No  Name            Percentage   Grade
===========================================
5        Rajesh Kumar    90.33        A
3        Rahul Sharma    90.00        A

<h3>14. Print girl students who have failed in at least two subjects.

In [54]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

select_query = """
    SELECT rollno, name
    FROM tblStudent
    WHERE gender = 'Female' AND (cmarks < 40 OR cppmarks < 40 OR pythonmarks < 40)
"""

cursor.execute(select_query)

failed_girls = cursor.fetchall()

print("{:<8} {:<15}".format("Roll No", "Name"))
print("=" * 27)

for record in failed_girls:
    rollno, name = record
    print("{:<8} {:<15}".format(rollno, name))

cursor.close()
conn.close()

Roll No  Name
===========================

<h3>15. Print youngest female topper.

In [56]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

select_query = """
    SELECT rollno, name
    FROM tblStudent
    WHERE gender = 'Female'
    ORDER BY birthdate ASC, percentage DESC
    LIMIT 1
"""

cursor.execute(select_query)

youngest_female_topper = cursor.fetchone()

print("{:<8} {:<15}".format("Roll No", "Name"))
print("=" * 27)

rollno, name = youngest_female_topper
print("{:<8} {:<15}".format(rollno, name))

cursor.close()
conn.close()

Roll No  Name
===========================
4        Deepika Reddy

<h3>16. Print oldest male topper.

In [57]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

select_query = """
    SELECT rollno, name
    FROM tblStudent
    WHERE gender = 'Male'
    ORDER BY birthdate DESC, percentage DESC
    LIMIT 1
"""

cursor.execute(select_query)

oldest_male_topper = cursor.fetchone()

print("{:<8} {:<15}".format("Roll No", "Name"))
print("=" * 27)

rollno, name = oldest_male_topper
print("{:<8} {:<15}".format(rollno, name))

cursor.close()
conn.close()

Roll No  Name
===========================
5        Rajesh Kumar

<h3>17. Change birth month to January who were born in December.

In [58]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="", database="dbStudent")
cursor = conn.cursor()

update_query = """
    UPDATE tblStudent
    SET birthdate = DATE_ADD(birthdate, INTERVAL 1 MONTH)
    WHERE MONTH(birthdate) = 12
"""

cursor.execute(update_query)

conn.commit()

cursor.close()
conn.close()

<h3>18. Change birthdate of topper student as 01-01-2000.

In [69]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="dbStudent"
)

cursor = conn.cursor()

select_query = "SELECT MAX(percentage) FROM tblStudent"

cursor.execute(select_query)
max_percentage = cursor.fetchone()[0]

update_query = "UPDATE tblStudent SET birthdate = '2000-01-01' WHERE percentage = %s"

cursor.execute(update_query, (max_percentage,))

conn.commit()

cursor.close()
conn.close()

<h3>19. List all students whose birthdate is yet to come in 2023.

In [71]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="dbStudent"
)

cursor = conn.cursor()

select_students_query = """
    SELECT rollno, name, birthdate
    FROM tblStudent
    WHERE YEAR(birthdate) = 2023
"""

cursor.execute(select_students_query)

results = cursor.fetchall()

print("{:<8} {:<15} {:<12}".format("Roll No", "Name", "Birthdate"))
print("=" * 35)

for row in results:
    rollno, name, birthdate = row
    print("{:<8} {:<15} {:<12}".format(rollno, name, birthdate))

cursor.close()
conn.close()

Roll No  Name            Birthdate
===================================

<h3>20. Create a stored procedure for inserting row in table. Show usage of it.

In [ ]:
# DELIMITER //

# CREATE PROCEDURE InsertStudent(
#     IN p_rollno INT,
#     IN p_name VARCHAR(255),
#     IN p_birthdate DATE,
#     IN p_gender VARCHAR(10),
#     IN p_cmarks INT,
#     IN p_cppmarks INT,
#     IN p_pythonmarks INT
# )
# BEGIN
#     INSERT INTO tblStudent(rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks)
#     VALUES(p_rollno, p_name, p_birthdate, p_gender, p_cmarks, p_cppmarks, p_pythonmarks);
# END;
# //

# DELIMITER ;

In [72]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="dbStudent"
)

cursor = conn.cursor()

rollno = 11
name = "Kaushal Tarpara"
birthdate = "2000-02-15"
gender = "Male"
cmarks = 85
cppmarks = 88
pythonmarks = 92

insert_student_query = "CALL InsertStudent(%s, %s, %s, %s, %s, %s, %s)"

cursor.execute(insert_student_query, (rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks))
print("Student data inserted")
conn.commit()

cursor.close()
conn.close()

Student data inserted

<h3>21. Create a stored procedure for fetching only female student rows. Show usage of it.

In [73]:
# # DELIMITER //

# CREATE PROCEDURE GetFemaleStudents()
# BEGIN
#     SELECT * FROM tblStudent WHERE gender = 'Female';
# END;
# //

# DELIMITER ;

In [105]:
import mysql.connector


conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="dbStudent"
)

cursor = conn.cursor()
cursor.callproc("GetFemaleStudents")
for result in cursor.stored_results():
    details = result.fetchall()
   


for row in details:
    print(row)

cursor.close()
conn.close()

(2, 'Priya Singh', datetime.date(1998, 3, 28), 'Female', 78, 85, 92, 255, Decimal('85.00'), 'B')
(4, 'Deepika Reddy', datetime.date(1996, 4, 25), 'Female', 88, 80, 78, 246, Decimal('82.00'), 'B')
(6, 'Pooja Verma', datetime.date(1997, 7, 18), 'Female', 84, 87, 85, 256, Decimal('85.33'), 'B')
(8, 'Neha Mishra', datetime.date(1998, 5, 8), 'Female', 79, 86, 94, 259, Decimal('86.33'), 'B')
(10, 'Anita Choudhary', datetime.date(1998, 1, 5), 'Female', 82, 83, 87, 252, Decimal('84.00'), 'B')

<h3>22. Create a stored procedure for fetching student records having grade as a specific parameter given by user. Show usage of it.

In [ ]:
# DELIMITER //

# CREATE PROCEDURE GetStudentsByGrade(IN p_grade VARCHAR(2))
# BEGIN
#      SELECT * FROM tblStudent WHERE grade = p_grade;
# END;
# //

In [100]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="dbStudent"
)

cursor = conn.cursor()
g = input("Enter grade :")
cursor.callproc("GetStudentsByGrade",[g])

for result in cursor.stored_results():
    details = result.fetchall()

for row in details:
    print(row)

cursor.close()
conn.close()

Enter grade :A
(3, 'Rahul Sharma', datetime.date(1997, 9, 10), 'Male', 90, 92, 88, 270, Decimal('90.00'), 'A')
(5, 'Rajesh Kumar', datetime.date(2000, 1, 1), 'Male', 92, 89, 90, 271, Decimal('90.33'), 'A')